{"about":{"title":"About Shovan Samuel","links":[],"tags":[],"content":"Extract from Linkedin\nA highly proficient digital strategist more than fourteen years of experience in executing digital platforms, digital marketing, social media and various digital content programs for global clients ranging from startups to well-established corporates.\nProven track record of delivering initiatives that improve business performance by planning the overall business strategy through creative digital innovations. Confidence, professionalism and a strong work ethic characterise my approach, while my work is distinguished by a crossover of creativity and technical expertise.\nDigital &amp; web experience\n\nCX &amp; Marketing: SEO, PPC, Social, CRO, A/B Testing, Analytics. UX, User Journey etc.\nDesign: UI, Prototyping, Wireframing, Responsive Design, Branding\nDevelopment: HTML, CSS, JS, PHP, MySQL, Python, Architecture, AWS, API’s, Bug fixing etc\nCMS: Sitecore, Drupa, Magento, Wordpress, Shopify, Jekyll (Headless CMS), Knowledge in AEM\nProduct: Ownership, Technical Requirement, Roadmap, MVP, Launches, Release, Code review\nSystems: Jira, Confluence, Adobe CC, Woocommerce, Salesforce, Pipeline deals, Zoho, Hubspot, Hotjar, Leadpages, Kissmetrics, Crazy Egg, Sumo, Unbounce, Survey Monkey, Optimizely etc\n\nSocial Links\nTwitter | Instagram | Github | LinkedIn"},"article/2020-03-01-digital-product-manager-vs-digital-product-owner":{"title":"Digital Product Manager & Digital Product Owner","links":[],"tags":[],"content":"Digital Product Manager &amp; Digital Product Owner\n\nResources\n\nProduct Manager: The role and how to master it{:target=“_blank”}\nLinkedin post{:target=“_blank”}\n"},"article/2020-03-09-sitecore-experience-2020":{"title":"Sitecore Experience 2020","links":[],"tags":[],"content":"Highlights from Sitecore Experience 2020\n\nSuperior customer experience can provide you with a significant competitive advantage\nExperience is the new economy … 74% of consumers prioritise experiences over products\nThe biggest challenges facing marketers are implementing personalisation and delivering experiences at scale\nCustomer Experience is driving digital transformation\nNot putting customers at the centre of our strategies is why 59% of consumers feel companies have lost touch with the human element of CX\n78% of millennials would rather spend money on experiences rather than products\n80% of marketers will abandon their personalisation efforts by 2025 due to lack of strategy\nMacmillan reduced the number of pages by at least 30%, had a clear content strategy that helps to retain number of users visiting the site and increased in conversion.\nMacmillan’s personalisation tactics, including asking web visitors five essential questions that enables an automated curated, personalised experience, and using progressive disclosure after that.\nOnly 3% want total automation, 75% prefer human server over automation\nThree E’s of customer experience - effectiveness, ease and emotion.\n49% of marketers don’t measure the ROI of their Content\nFour ways to consider content effectiveness:  Topic coverage &amp; findability, Brand language &amp; emotional apple, Reach &amp; engagement and Business impact &amp; efficiency\nCreate empathy, not just content. To create content that resonates and builds a connection with customers, we need to be able to manage, share and scale it effectively.\nMeaningful experiences are both personalised and personal. Personalised in ways that show you know who I am, and individual in that you know what I care about. This makes customers feel seen, heard and listened to.\nThe brain is programmed to notice things that move - this is part of our survival instinct\nThe ‘perfect’ world of advertising is not quite up there with what consumers are looking for - our brains detect if something/someone is not genuine.\nWhen brands speak ‘human’ people connect.\nBy 2022, Gartner stats your phone will know you better than your own family\nClear communication is a top driver of customer experience\nSitecore Automated Personalisation is coming\nSitecore for SaaS underway\n\n“49% of marketers don’t measure the ROI of their #content” Some home truths from @Sitecore’s @timpashuysen in his talk on “Measuring Content Effectiveness” #SitecoreEXP pic.twitter.com/m2SZIn6UUI— Helen Fetherston (@HCFetherston) March 4, 2020 \n"},"article/2020-05-01-smart-way-to-switch-between-dev-environments":{"title":"A Smart way to switch between dev environments.","links":[],"tags":[],"content":"As part of the web production workflow, I currently have various environments. To validate a page between live and staging requires one manually change the URL path from www. to staging. .\nI am looking to simplify this process, reduce human error and automate where possible. I found Domain Switcher{:target=“_blank”} chrome extension that does does what I need.\nEnvironment breakdown\n\nLive Environment: **www.**website.com\nStaging Environment: **staging.**website.com\nDev Environment: **dev.**website.com\nQA Environment: **qa.**website.com\nLocal Environment: **local.**website.com\n\nExtension Setup\nInstall Domain Switcher{:target=“_blank”} extension on your chrome browser\nOnce installed, click on options.\n\nAdd your dev environments to the list.\n\nNow go the website website.com and click on the Domain Switcher extension, you will see options for the different environments in the dropdown.\n"},"article/2021-09-19-chrome-extension-to-clear-cookie--cache":{"title":"Chrome Extension to Clear Cookie & Cache","links":["tags/webops"],"tags":["webops"],"content":"I have created Breeze{: target=“_blank” rel=“noopener”}, a free chrome extension{: target=“_blank” rel=“noopener”} that can help your non-team work faster.\n\nBreeze is All-in-one tools that an be used for Website migration project, day to day website operation taskwebops\n\nHere are few things you can achieve with Breeze\n{: width=“1920” height=“auto”}\n\nWebsite Environment Manager and Switcher\nRedirection Management\nSitemap Manager\nFile Manager\nPage breakdown and auditing tool\nAudit tool (Screenshot taker and recorder)\nReports\nWebsite Migration Checklist\n\nThe tool that could be used during website migration, we are building tool that could be used for the website management team to operate their websites\nBreeze website management tool allows business to easily onboard their team. Sign-up to breeze and get value for the money\n{: width=“1920” height=“auto”}\n\nAccess wide set of tools\nShare tools with teams\nEasy to manage website\nHave audit trail for compliance and regulations\nCut cost on development cost as we handle all the world\n\nWe are continually improving the tool and add various toolkit that will help you with website migration, ongoing website operations task, technical SEO, on-page SEO, page screen-short, auditing page performance and many more.\nWith Breeze chrome extension{: target=“_blank” rel=“noopener”} you can perform following activities\n\nDomain Switcher (Live, Dev, UAT, QA and Local)\nDomain Switcher for Multi-regional, Multi lingual solution\nDomain switcher to work with the following CMS WordPress, Sitecore, Adobe Experience Manager (AEM) and many more.\nInformation on Technology stack, such as domain expiry date, CDN, fav icon, DNS, CMS platform, CMS version and latest valuable version\nDev browser bookmarks manager, that could be share with the team. Also categorize bookmark and share it in cloud.\nPingdom - Activity tracker (Future Release), we are also planning to make not of all the pingdom issues.\n\nBreeze tool is early-beta stage, please provide us with your valuable feedback and let us know what features you would like to see.\nThanksShovan"},"index":{"title":"Hi 👋, I'm Shovan Samuel !","links":[],"tags":[],"content":"A highly proficient digital strategist more than fourteen years of experience in executing digital platforms, digital marketing, social media and various digital content programs for global clients ranging from startups to well-established corporates.\nProven track record of delivering initiatives that improve business performance by planning the overall business strategy through creative digital innovations. Confidence, professionalism and a strong work ethic characterise my approach, while my work is distinguished by a crossover of creativity and technical expertise.\nDigital &amp; web experience\n\nCX &amp; Marketing: SEO, PPC, Social, CRO, A/B Testing, Analytics. UX, User Journey etc.\nDesign: UI, Prototyping, Wireframing, Responsive Design, Branding\nDevelopment: HTML, CSS, JS, PHP, MySQL, Python, Architecture, AWS, API’s, Bug fixing etc\nCMS: Sitecore, Drupa, Magento, Wordpress, Shopify, Jekyll (Headless CMS), Knowledge in AEM\nProduct: Ownership, Technical Requirement, Roadmap, MVP, Launches, Release, Code review\nSystems: Jira, Confluence, Adobe CC, Woocommerce, Salesforce, Pipeline deals, Zoho, Hubspot, Hotjar, Leadpages, Kissmetrics, Crazy Egg, Sumo, Unbounce, Survey Monkey, Optimizely etc\n\nOnline\nTwitter | Instagram | Github | LinkedIn"}}